Revit 2027 API
FabricationPart.IsProductListEntryCompatibleSize Method
 Checks to see if this part can be changed to the specified product entry without altering any connected dimensions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsProductListEntryCompatibleSize(
	int productEntry
)
Public Function IsProductListEntryCompatibleSize (
	productEntry As Integer
) As Boolean
public:
bool IsProductListEntryCompatibleSize(
	int productEntry
)
member IsProductListEntryCompatibleSize :
        productEntry : int -> bool
Parameters
productEntry Int32
 The product entry index.
Return Value
Boolean
 Returns true if the part can be changed to the specified product entry without altering any connected dimensions.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The product entry index is not larger than 0 and less than GetProductCount.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace